# web - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.random_password.nextauthsecret: Refreshing state... [id=none]
module.common_resources.data.vercel_project_directory.default: Reading...
module.common_resources.data.vercel_project_directory.default: Read complete after 0s [id=../../../]
module.common_resources.data.aws_apigatewayv2_apis.customer_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.gateway_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.connect_api_api_gateway_id: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Reading...
module.common_resources.data.aws_apigatewayv2_apis.identity_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.organization_api_api_gateway_id: Reading...
module.common_resources.data.aws_apigatewayv2_apis.connect_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_apis.organization_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.organization_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_api.connect_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.identity_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.identity_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.customer_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.customer_api_api_gateway: Reading...
module.common_resources.data.aws_apigatewayv2_apis.gateway_api_api_gateway_id: Read complete after 0s [id=us-east-1]
module.common_resources.data.aws_apigatewayv2_api.gateway_api_api_gateway: Reading...
module.common_resources.data.aws_cognito_user_pools.user_pool: Read complete after 0s [id=staging]
module.common_resources.aws_cognito_user_pool_client.default: Refreshing state... [id=3i8obca6256a6unope9gfhhtnj]
module.common_resources.data.aws_apigatewayv2_api.organization_api_api_gateway: Read complete after 0s [id=dvkrhd45gl]
module.common_resources.data.aws_apigatewayv2_api.connect_api_api_gateway: Read complete after 0s [id=7xtxxxrn73]
module.common_resources.data.aws_apigatewayv2_api.identity_api_api_gateway: Read complete after 0s [id=3pyppuwhfb]
module.common_resources.data.aws_apigatewayv2_api.customer_api_api_gateway: Read complete after 0s [id=69xvvdign5]
module.common_resources.data.aws_apigatewayv2_api.gateway_api_api_gateway: Read complete after 0s [id=hao1yu9ybh]
module.common_resources.vercel_project.default: Refreshing state... [id=prj_5W4ozc65mQTIbP2vxxrAAOf7Mefe]
module.common_resources.vercel_project_domain.default: Refreshing state... [id=new-staging.connectilly.com]
module.common_resources.vercel_deployment.default: Refreshing state... [id=dpl_3dzFrNNVxsRdWrPs27ovqVGDtfvW]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.common_resources.vercel_deployment.default must be replaced
-/+ resource "vercel_deployment" "default" {
      ~ domains     = [ # forces replacement
          - "new-staging.connectilly.com",
          - "staging-web-henna.vercel.app",
          - "staging-web-connectilly.vercel.app",
          - "staging-web-mortezaconnectilly-connectilly.vercel.app",
        ] -> (known after apply) # forces replacement
      ~ files       = { # forces replacement
          ~ "../../../infrastructure/workspaces/common_resources/resources.tf"                                = "5330~d50f48d1eeb1201fdd0073aa902420b0392da25c" -> "5909~6654a742d7f831c188a58bbf9487e67d28fafead"
          ~ "../../../src/types/environment.d.ts"                                                             = "354~f96a483839a0118937c98b3b75896bbc9d65f9f4" -> "386~efd7bd460648e72bf13d25b844176cfe4ea731ae"
            # (107 unchanged elements hidden)
        }
      ~ id          = "dpl_3dzFrNNVxsRdWrPs27ovqVGDtfvW" -> (known after apply)
      ~ url         = "staging-f26ffhyzb-connectilly.vercel.app" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.common_resources.vercel_project.default will be updated in-place
  ~ resource "vercel_project" "default" {
      ~ environment                = (sensitive value)
        id                         = "prj_5W4ozc65mQTIbP2vxxrAAOf7Mefe"
        name                       = "staging-web"
      + serverless_function_region = (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*